Revit 2027 API
SpecTypeId.BarDiameter Property
 Bar Diameter, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BarDiameter { get; }
Public Shared ReadOnly Property BarDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BarDiameter {
	ForgeTypeId^ get ();
}
static member BarDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace